In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    "col1" : [1,2,3,4],
    "col2" : [444,555,666,444],
    "col3" : ["abc", "def", "ghi", "jkl"]
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [5]:
df["col1"].nunique() #con esta función vemos que tenemos cuatro valores únicos, veamos el caso de col2
df["col2"].nunique() #lo cual es cierto, ya que 444 se repite dos veces

3

In [8]:
df["col2"].unique()

array([444, 555, 666])

In [9]:
df["col2"].value_counts() #veamos cuantos valores hay de cada renglón en la columna col2

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
#veamos el caso en el que queramos ponerle una función que definamos a los valoresde n columna ;) 
def times2(x):
    return x*2

In [7]:
df["col2"].apply(times2)
#df["col1"].apply(times2) esto en el caso de la columna 1

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [12]:
#veamos q de igual manera sirve con len 
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [14]:
df.sort_values("col2") #nos acomoda de los valores más bajos a los más altos :)

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi